Repository: hanbin2007/PlsInput
Catalog: App/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans

source: %lld day streak
zh_hans: 连续 %lld 天

source: + adds, × multiplies, ^ raises to a power (right to left: 2^3^2 = 2^9), ! is factorial and binds tightest, ( ) group.
zh_hans: + 加，× 乘，^ 乘方（从右往左：2^3^2 = 2^9），! 阶乘且优先级最高，( ) 括号。

source: A new slot! Choose a type. Rot is paused while you decide.
zh_hans: 新格子！选一种类型。选的时候不腐烂。

source: About
zh_hans: 关于

source: All rewards claimed
zh_hans: 道具已拿完

source: All time
zh_hans: 总榜

source: Amp
zh_hans: 增幅格

source: Bag full and every key is at full durability. The repair kit was lost.
zh_hans: 背包满了，而且每个键都是满耐久，这个修键作废了。

source: Bag is empty
zh_hans: 背包是空的

source: Bag is full. Tap a key to repair it now (+%lld).
zh_hans: 背包满了。点一个键立即修理（+%lld）。

source: Best: %@
zh_hans: 最高：%@

source: Board
zh_hans: 榜单

source: Build the biggest number you can with today's keyboard. Your peak value is your score.
zh_hans: 用今天的键盘拼出尽可能大的数，整局的峰值就是分数。

source: Cancel
zh_hans: 取消

source: Choose the new slot's type.
zh_hans: 选择新格子的类型。

source: Come back tomorrow for a new puzzle.
zh_hans: 明天再来，有新题。

source: Config
zh_hans: 配置

source: Continue
zh_hans: 继续

source: Convert a slot to %@.
zh_hans: 把一个格子改成%@。

source: Couldn't load the leaderboard.
zh_hans: 排行榜加载失败。

source: Cross 1,000 to earn a reward. Press one more 9.
zh_hans: 跨过 1,000 就有道具。再按一个 9。

source: Cross a threshold for the first time to earn a reward: new keys, new slots, slot conversions, repair kits, or a freeze that pauses rot. The bag holds three items.
zh_hans: 首次跨过一个阈值就发一个道具：新键、新格子、改格、修键，或者暂停腐烂的冻结。背包放三个。

source: Daily puzzle
zh_hans: 每日题

source: Digits count double: 9 becomes 18.
zh_hans: 数字按两倍计：9 当 18。

source: Digits rot at normal speed.
zh_hans: 数字按正常速度腐烂。

source: Digits rot. Watch the red bar under a slot and wait for a digit to drop.
zh_hans: 数字会腐烂。看格子下面的红条，等一个数字掉一格。

source: Done
zh_hans: 完成

source: Durability
zh_hans: 耐久

source: Each key has a limited number of presses. At 0 it breaks. Repair kits restore it, up to its original durability. Filling a Rotten slot is free.
zh_hans: 每个键有固定次数，到 0 就坏。修键能修回来，但不超过初始耐久。填烂格不耗耐久。

source: Echo
zh_hans: 回声格

source: End
zh_hans: 结束

source: End this run?
zh_hans: 结束这一局？

source: Ended by
zh_hans: 结束原因

source: Ending
zh_hans: 结束

source: Every digit you place ticks down over time until it reaches 0. Overwrite it to refresh. Operators never rot.
zh_hans: 填进去的数字会随时间往下掉，掉到 0 为止。覆盖它就能刷新。运算符不腐烂。

source: Every key shows how many presses it has left. At 0 the key breaks. Repair kits bring it back.
zh_hans: 每个键右下角是剩余次数，到 0 键就坏了。修键道具能修回来。

source: Fill it with 9. Three digits in the exponent are astronomically more than two.
zh_hans: 往里填个 9。指数从两位变三位，数大到天文级别。

source: Finish
zh_hans: 完成

source: Freeze %llds
zh_hans: 冻结 %lld 秒

source: Freeze %llds added to your bag.
zh_hans: 冻结 %lld 秒已放进背包。

source: Friends only
zh_hans: 只看好友

source: Goal
zh_hans: 目标

source: Goal: build the biggest number you can. Everything else is a means to that.
zh_hans: 目标：拼出尽可能大的数。其它一切都是为了这个。

source: Haptics
zh_hans: 震动反馈

source: How to play
zh_hans: 怎么玩

source: Keys worn out
zh_hans: 键全报废

source: Leaderboard
zh_hans: 排行榜

source: Long-press a slot to clear it.
zh_hans: 长按格子可清空。

source: Mirrors the slot two to its left. Free, can't be filled directly.
zh_hans: 复制左边第二格的内容。免费，但不能直接填。

source: Never rots.
zh_hans: 永不腐烂。

source: New key unlocked: %@
zh_hans: 解锁新键：%@

source: New slot! Choose its type
zh_hans: 新格子！选一种类型

source: New slot! Pick a type and where to put it.
zh_hans: 新格子！选类型和位置。

source: Next at %@
zh_hans: 下一档 %@

source: Next reward at
zh_hans: 下一个道具在

source: No scores yet.
zh_hans: 还没有分数。

source: Normal
zh_hans: 普通格

source: Not ranked
zh_hans: 未进榜

source: Not signed in
zh_hans: 未登录

source: Now tap a gap to place it. Position matters: next to ^ it becomes part of the exponent.
zh_hans: 现在点一个缝隙放进去。位置有讲究：放在 ^ 右边就成了指数的一部分。

source: One attempt per day. Everyone gets the same keyboard.
zh_hans: 每天一次机会，所有人同一个键盘。

source: Operators
zh_hans: 运算符

source: Peak
zh_hans: 峰值

source: Play today's puzzle
zh_hans: 开始今天的题

source: PlsInput
zh_hans: 请输入

source: PlsInput %@ · %@
zh_hans: 请输入 %1$@ · %2$@

source: PlsInput %@ · %@ · #%lld
zh_hans: 请输入 %1$@ · %2$@ · 第 %3$lld 名

source: PlsInput practice · %@
zh_hans: 请输入 练习 · %@

source: Practice
zh_hans: 练习

source: Practice result
zh_hans: 练习成绩

source: Press 9.
zh_hans: 按一下 9。

source: Press a key to fill the next empty slot. Tap a filled slot, then press a key to overwrite it. Long-press to clear. Adjacent digits join into one number.
zh_hans: 按键填进下一个空格。点已填的格子再按键就是覆盖。长按清空。相邻数字会连成一个数。

source: Random puzzles, unlimited tries, no ranking.
zh_hans: 随机题，不限次数，不计排名。

source: Rank
zh_hans: 排名

source: Repair +%lld
zh_hans: 修键 +%lld

source: Repair kit +%lld added to your bag.
zh_hans: 修键 +%lld 已放进背包。

source: Retry
zh_hans: 重试

source: Rewards
zh_hans: 道具

source: Rewards %lld / %lld
zh_hans: 道具 %1$lld / %2$lld

source: Rewards claimed
zh_hans: 拿到道具

source: Rewards claimed: %lld
zh_hans: 拿到道具：%lld 个

source: Rot
zh_hans: 腐烂

source: Rot is paused while you choose.
zh_hans: 选择期间不腐烂。

source: Rots twice as fast, but filling it costs no durability.
zh_hans: 腐烂两倍速，但填它不耗耐久。

source: Rotten
zh_hans: 烂格

source: Rules
zh_hans: 规则

source: Save it: tap the rotted slot, then press 9. Overwriting costs one press of durability.
zh_hans: 救它：先点那个烂掉的格子，再按 9。覆盖要花一次耐久。

source: Settings
zh_hans: 设置

source: Share
zh_hans: 分享

source: Sign in
zh_hans: 登录

source: Sign in to Game Center to rank
zh_hans: 登录 Game Center 才能进榜

source: Sign in to Game Center to see rankings.
zh_hans: 登录 Game Center 才能看排名。

source: Signed in
zh_hans: 已登录

source: Skip
zh_hans: 跳过

source: Slot selected. Press a key to overwrite it, or tap it again to deselect.
zh_hans: 已选中格子。按键覆盖它，或再点一次取消。

source: Slot types
zh_hans: 格子类型

source: Slot types: Stable never rots. Echo copies the slot two to its left. Amp doubles a digit. Rotten rots fast but costs no durability.
zh_hans: 格子类型：稳定格不腐烂；回声格复制左边第二格；增幅格数字翻倍；烂格腐烂快但填它不耗耐久。

source: Slots and keys
zh_hans: 格子与键

source: Slots are full. Tap a slot, then press a key to overwrite it.
zh_hans: 格子满了。点一个格子，再按键覆盖它。

source: Stable
zh_hans: 稳定格

source: Status
zh_hans: 状态

source: Submitted
zh_hans: 已提交

source: Submitting…
zh_hans: 提交中…

source: Tap a gap to place the %@ slot.
zh_hans: 点一个缝隙放入%@。

source: Tap a key to repair it.
zh_hans: 点一个键来修理它。

source: Tap a slot to convert it to %@.
zh_hans: 点一个格子把它改成%@。

source: That's the game. One puzzle a day, one attempt, everyone on the same keyboard. Your peak is your score.
zh_hans: 就这些。每天一题，一次机会，所有人同一个键盘。峰值就是你的分数。

source: The run ends when every key is broken with no repair kit left, when you tap End, or after five minutes.
zh_hans: 所有键坏掉且没有修键、你点了结束、或者到五分钟，这局就结束。

source: This version is too old for today's puzzle. Please update the app.
zh_hans: 当前版本太旧，无法玩今天的题，请更新应用。

source: Time
zh_hans: 用时

source: Time limit
zh_hans: 时间到

source: Today
zh_hans: 今天

source: Today's result
zh_hans: 今日成绩

source: Two items landed in your bag. Tap Freeze to pause rot for 10 seconds.
zh_hans: 两个道具进了背包。点冻结，腐烂暂停 10 秒。

source: Two more 9s. Make it 999.
zh_hans: 再按两次 9，拼成 999。

source: Type the biggest number you can.
zh_hans: 输入一个尽可能大的数。

source: Version
zh_hans: 版本

source: You
zh_hans: 你

source: You ended it
zh_hans: 主动结束

source: You unlocked ^. Tap the second slot, then press ^ to turn 9999 into 9^99.
zh_hans: 你解锁了 ^。点第二个格子，再按 ^，把 9999 变成 9^99。

source: Your peak so far becomes your score.
zh_hans: 目前的峰值就是你的分数。
